Revit 2026 API

# SpatialElementFromToCalculationPointsIsAcceptableToPosition Method

---

Checks whether a given "to" position is valid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsAcceptableToPosition(
	XYZ toPosition
)
```
```vb
Public Function IsAcceptableToPosition (
	toPosition As XYZ
) As Boolean
```
```cpp
public:
bool IsAcceptableToPosition(
	XYZ^ toPosition
)
```
```fsharp
member IsAcceptableToPosition :
        toPosition : XYZ -> bool
```

#### Parameters

toPosition XYZ

#### Return Value

Boolean True if the input is an acceptable "to" position and False otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The "from" position and the "to" position must be on opposite sides of the family's host. Flipping the calculation point will reverse the direction.

#### Reference

SpatialElementFromToCalculationPoints Class

Autodesk.Revit.DB Namespace